using Artisan.Autocraft;
using Artisan.CraftingLists;
using Artisan.RawInformation;
using ClickLib.Clicks;
using Dalamud.Game.ClientState.Statuses;
using ECommons;
using ECommons.Logging;
using FFXIVClientStructs.FFXIV.Client.Game;
using FFXIVClientStructs.FFXIV.Client.UI;
using FFXIVClientStructs.FFXIV.Client.UI.Agent;
using FFXIVClientStructs.FFXIV.Component.GUI;
using Lumina.Excel.GeneratedSheets;
using System;
using System.Linq;
using System.Runtime.InteropServices;
using static Artisan.CraftingLogic.CurrentCraft;

namespace Artisan.CraftingLogic
{
    public unsafe static class CurrentCraft
    {
        public static class Skills
        {
            public const uint
                BasicSynth = 100001,
                BasicTouch = 100002,
                MastersMend = 100003,
                HastyTouch = 100355,
                RapidSynthesis = 100363,
                Observe = 100010,
                Tricks = 100371,
                WasteNot = 4631,
                Veneration = 19297,
                StandardTouch = 100004,
                GreatStrides = 260,
                Innovation = 19004,
                FinalAppraisal = 19012,
                WasteNot2 = 4639,
                ByregotsBlessing = 100339,
                PreciseTouch = 100128,
                MuscleMemory = 100379,
                CarefulSynthesis = 100203,
                Manipulation = 4574,
                PrudentTouch = 100227,
                FocusedSynthesis = 100235,

                //if (progressActions->PrudentSynthesis.CanComplete(remainingProgress) == allowComplete)
                //    return ActionId.PrudentSynthesis;

                if (progressActions->CarefulSynthesis.CanComplete(remainingProgress) == false)
                {
                    action = Skills.CarefulSynthesis;
                    return allowComplete;
                }
            }

            action = Skills.BasicSynth;
            return progressActions->BasicSynthesis.CanComplete(remainingProgress)!.Value;
        }
    }



    public static class CraftingActionExtensions
    {
        public static int ProgressIncrease(this uint Id)
        {
            var multiplier = GetMultiplier(Id, false);
            double veneration = GetStatus(Buffs.Veneration) != null ? 0.5 : 0;
            double muscleMemory = GetStatus(Buffs.MuscleMemory) != null ? 1 : 0;
            return (int)Math.Floor(BaseProgression() * multiplier * (veneration + muscleMemory + 1));
        }

        public static int QualityIncrease(this uint id)
        {
            double efficiency = GetMultiplier(id, true);
            double IQStacks = GetStatus(Buffs.InnerQuiet) is null ? 1 : 1 + (GetStatus(Buffs.InnerQuiet).StackCount * 0.1);
            double innovation = GetStatus(Buffs.Innovation) is not null ? 0.5 : 0;
            double greatStrides = GetStatus(Buffs.GreatStrides) is not null ? 1 : 0;

            return (int)Math.Floor(BaseQuality() * efficiency * IQStacks * (innovation + greatStrides + 1));

        }

        public static bool IsAvailable(this ProgressEfficiencyCalculation progressActionInfo)
    => progressActionInfo.Status == ActionStatus.Available;

        public static bool IsAvailable(this QualityEfficiencyCalculation progressActionInfo)
            => progressActionInfo.Status == ActionStatus.Available;

        public static bool? CanComplete(this ProgressEfficiencyCalculation progressActionInfo, uint remainingProgress)
        {
            if (!progressActionInfo.IsAvailable())
                return null;

            return progressActionInfo.ProgressIncrease >= remainingProgress;
        }

        public static bool CanComplete(this QualityEfficiencyCalculation qualityActionInfo, uint remainingQuality)
            => qualityActionInfo.IsAvailable() && qualityActionInfo.QualityIncrease >= remainingQuality;

        public static bool HasStatus(this StatusList? statusList, out int stack, params CraftingPlayerStatuses[] elligable)
        {
            stack = 0;

            var status = statusList?.FirstOrDefault(buff => elligable.Any(s => buff.StatusId == (uint)s));
            if (status == null)
                return false;

            stack = status.StackCount;
            return true;
        }
    }

    public enum SynthesisStatus : uint
    {
        Normal = 0,
        Poor = 1,
        Good = 2,
        Excellent = 3,
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x200)]
    public struct SynthesisAtkValues
    {
        // Confirm these are all UInt (based on the AtkValue 1st byte)
        [FieldOffset(0x058)] public uint Progress;
        [FieldOffset(0x068)] public uint MaxProgress;
        [FieldOffset(0x078)] public uint Durability;
        [FieldOffset(0x088)] public uint MaxDurability;
        [FieldOffset(0x098)] public uint Quality;
        [FieldOffset(0x0A8)] public uint HqChance; // Does this make sense for Collectables?

        [FieldOffset(0x0C8)] public SynthesisStatus Status;


        [FieldOffset(0x0F8)] public uint Step;

        [FieldOffset(0x118)] public uint MaxQuality;


        [FieldOffset(0x148)] public uint Collectability;

        [FieldOffset(0x168)] public uint CollectabilityLow;
        [FieldOffset(0x178)] public uint CollectabilityMedium;
        [FieldOffset(0x188)] public uint CollectabilityHigh;
        // Last one?
    }
}
