using Artisan.Autocraft;
using Artisan.CraftingLists;
using Artisan.RawInformation;
using Artisan.RawInformation.Character;
using ClickLib.Clicks;
using Dalamud.Game.ClientState.Statuses;
using ECommons;
using ECommons.Logging;
using FFXIVClientStructs.FFXIV.Client.Game;
using FFXIVClientStructs.FFXIV.Client.UI;
using FFXIVClientStructs.FFXIV.Client.UI.Agent;
using FFXIVClientStructs.FFXIV.Component.GUI;
using Lumina.Excel.GeneratedSheets;
using System;
using System.Linq;
using System.Runtime.InteropServices;
using static Artisan.CraftingLogic.CurrentCraft;

namespace Artisan.CraftingLogic
{
    public static unsafe partial class CurrentCraft
    {
        public static event EventHandler<int>? StepChanged;
        public static int CurrentDurability { get; set; } = 0;
        public static int MaxDurability { get; set; } = 0;
        public static int CurrentProgress { get; set; } = 0;
        public static int MaxProgress { get; set; } = 0;
        public static int CurrentQuality { get; set; } = 0;
        public static int MaxQuality { get; set; } = 0;
        public static int HighQualityPercentage { get; set; } = 0;
        public static string? RecommendationName { get; set; }
        public static Condition CurrentCondition { get; set; }
        private static int currentStep = 0;
        private static int quickSynthCurrent = 0;
        private static int quickSynthMax = 0;
        private static CraftingState state = CraftingState.NotCrafting;


                //    return ActionId.PrudentSynthesis;

                if (progressActions->CarefulSynthesis.CanComplete(remainingProgress) == false)
                {
                    action = Skills.CarefulSynthesis;
                    return allowComplete;
                }
            }

            action = Skills.BasicSynth;
            return progressActions->BasicSynthesis.CanComplete(remainingProgress)!.Value;
        }
    }



    public static class CraftingActionExtensions
    {
        public static int ProgressIncrease(this uint Id)
        {
            var multiplier = Calculations.GetMultiplier(Id, false);
            double veneration = GetStatus(Buffs.Veneration) != null ? 0.5 : 0;
            double muscleMemory = GetStatus(Buffs.MuscleMemory) != null ? 1 : 0;
            return (int)Math.Floor(Calculations.BaseProgression() * multiplier * (veneration + muscleMemory + 1));
        }

        public static int QualityIncrease(this uint id)
        {
            double efficiency = Calculations.GetMultiplier(id, true);
            double IQStacks = GetStatus(Buffs.InnerQuiet) is null ? 1 : 1 + (GetStatus(Buffs.InnerQuiet).StackCount * 0.1);
            double innovation = GetStatus(Buffs.Innovation) is not null ? 0.5 : 0;
            double greatStrides = GetStatus(Buffs.GreatStrides) is not null ? 1 : 0;

            return (int)Math.Floor(Calculations.BaseQuality() * efficiency * IQStacks * (innovation + greatStrides + 1));

        }

        public static bool IsAvailable(this ProgressEfficiencyCalculation progressActionInfo)
    => progressActionInfo.Status == ActionStatus.Available;

        public static bool IsAvailable(this QualityEfficiencyCalculation progressActionInfo)
            => progressActionInfo.Status == ActionStatus.Available;

        public static bool? CanComplete(this ProgressEfficiencyCalculation progressActionInfo, uint remainingProgress)
        {
            if (!progressActionInfo.IsAvailable())
                return null;

            return progressActionInfo.ProgressIncrease >= remainingProgress;
        }

        public static bool CanComplete(this QualityEfficiencyCalculation qualityActionInfo, uint remainingQuality)
            => qualityActionInfo.IsAvailable() && qualityActionInfo.QualityIncrease >= remainingQuality;

        public static bool HasStatus(this StatusList? statusList, out int stack, params CraftingPlayerStatuses[] elligable)
        {
            stack = 0;

            var status = statusList?.FirstOrDefault(buff => elligable.Any(s => buff.StatusId == (uint)s));
            if (status == null)
                return false;

            stack = status.StackCount;
            return true;
        }
    }

    public enum SynthesisStatus : uint
    {
        Normal = 0,
        Poor = 1,
        Good = 2,
        Excellent = 3,
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x200)]
    public struct SynthesisAtkValues
    {
        // Confirm these are all UInt (based on the AtkValue 1st byte)
        [FieldOffset(0x058)] public uint Progress;
        [FieldOffset(0x068)] public uint MaxProgress;
        [FieldOffset(0x078)] public uint Durability;
        [FieldOffset(0x088)] public uint MaxDurability;
        [FieldOffset(0x098)] public uint Quality;
        [FieldOffset(0x0A8)] public uint HqChance; // Does this make sense for Collectables?

        [FieldOffset(0x0C8)] public SynthesisStatus Status;


        [FieldOffset(0x0F8)] public uint Step;

        [FieldOffset(0x118)] public uint MaxQuality;


        [FieldOffset(0x148)] public uint Collectability;

        [FieldOffset(0x168)] public uint CollectabilityLow;
        [FieldOffset(0x178)] public uint CollectabilityMedium;
        [FieldOffset(0x188)] public uint CollectabilityHigh;
        // Last one?
    }
}
